OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/adjoint/piggyChtMultiRegionTopologySigmoidFoam/conjugateHeatedSolid_new/constant/fluid/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*limitT
{
	type            limitTemperature;
	region          fluid;
	active          no;
	limitTemperatureCoeffs
	{
		selectionMode   all;
		min             300;
		max             500;
	}
}*/

// ************************************************************************* //
