OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/adjoint/piggyChtMultiRegionTopologySigmoidFoam/conjugateHeatedSolid_new/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

verbose no;
scale 1;

vertices
(
  (0 0 0)     // 0
  (2 0 0)     // 1
  (0 0.1 0)   // 2
  (2 0.1 0)   // 3
  (0 0.1 0)   // 4
  (2 0.1 0)   // 5
  (0 0.2 0)   // 6
  (2 0.2 0)   // 7
//
  (0 0 0.01)   // 8
  (2 0 0.01)   // 9
  (0 0.1 0.01) // 10
  (2 0.1 0.01) // 11
  (0 0.1 0.01) // 12
  (2 0.1 0.01) // 13
  (0 0.2 0.01) // 14
  (2 0.2 0.01) // 15 
);

lvl 20;

blocks
(
    hex (0 1 3 2 8 9 11 10)     fluid  ( 200 60 1 ) simpleGrading (1 1 1)
    hex (4 5 7 6 12 13 15 14)   solid  ( 200 40 1 ) simpleGrading (1 1 1)
);

defaultPatch
{
    name    front_and_back;
    type    empty;
}

boundary
(
    inlet
    {
      type            patch;
    
      faces
      (
        (0 2 10 8)
      );
    }

    outlet
    {
      type            patch;
    
      faces
      (
        (3 1 9 11)
      );
    }

    fluid_walls
    {
      type            wall;
    
      faces
      (
        (0 1 9 8)
      );
    }

    solid_walls
    {
      type            wall;
    
      faces
      (
        (4 6 14 12)
        (6 7 15 14)
        (7 5 13 15)
      );
    }

    fluid_to_solid
    {
      type            mappedWall;
      sampleMode      nearestPatchFace;
      sampleRegion    solid;
      samplePatch     solid_to_fluid;
    
      faces
      (
        (2 3 11 10)
      );
    }

    solid_to_fluid
    {
      type            mappedWall;
      sampleMode      nearestPatchFace;
      sampleRegion    fluid;
      samplePatch     fluid_to_solid;
    
      faces
      (
        (5 4 12 13)
      );
    }
);

// ************************************************************************* //
