OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/adjoint/piggyChtMultiRegionTopologySigmoidFoam/conjugateHeatedSolid_new/system/fluid/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    optCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.2 0 0) (1.6 1 0.1);
    }
    {
        name    optZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     optCells;
    }
);

// ************************************************************************* //
